performance/tests/order.yml
execution:
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: get-orders
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: get-order
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: search-orders
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: get-requesting-facilities
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: print-order-pdf
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: print-order-csv
  - concurrency: 10
    hold-for: 2m
    iterations: 10
    scenario: export-order-csv


scenarios:
  get-orders:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders
        method: GET
        label: GetAllOrders
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-order:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}
        method: GET
        label: GetOrder
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  search-orders:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders?supplyingFacilityId=${__P(supplying_facility_id)}
        method: GET
        label: FindOrdersBySupplyingFacility
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-requesting-facilities:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/requestingFacilities?supplyingFacilityId=${__P(supplying_facility_id)}
        method: GET
        label: GetRequestingFacilities
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-order-pdf:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/print?format=pdf
        method: GET
        label: PrintOrderAsPdf
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-order-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/print?format=csv
        method: GET
        label: PrintOrderAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  export-order-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/export?type=csv
        method: GET
        label: ExportOrderAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
reporting:
    - module: passfail
      criteria:
        Get All Orders is too slow: p90 of GetAllOrders>4700ms
        Get Order is too slow: p90 of GetOrder>8000ms
        Find Order By Supplying Facility is too slow: p90 of FindOrdersBySupplyingFacility>4000ms
        Get Requesting Facilities is too slow: p90 of GetRequestingFacilities>500ms
        Print Order As Pdf is too slow: p90 of PrintOrderAsPdf>170000ms
        Print Order As Csv is too slow: p90 of PrintOrderAsCsv>170000ms
        Export Order As Csv is too slow: p90 of ExportOrderAsCsv>200000ms