performance/tests/orderFileTemplate.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-order-file-template

scenarios:
  get-order-file-template:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/csvFileTemplates
        method: GET
        label: GetOrderFileTemplate
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
reporting:
    - module: passfail
      criteria:
        Get Order File Template is too slow: p90 of GetOrderFileTemplate>1000ms