performance/tests/orderFileTemplate.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-order-file-template

scenarios:
  get-order-file-template:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/fileTemplates
        method: GET
        label: GetOrderFileTemplate
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
reporting:
    - module: passfail
      criteria:
        - 'p90>2500ms, continue as failed, label=GetOrderFileTemplate, title="p90 response time too high"'
        - 'p90>1500ms and p90<=2500ms, continue as passed, label=GetOrderFileTemplate, title="Improvement needed"'
        - 'failures>1%, continue as failed, label=GetOrderFileTemplate, title="Failure rate too high"'