performance/tests/orderFileTemplate.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-order-file-template

scenarios:
  get-order-file-template:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orderFileTemplates
        method: GET
        label: GetOrderFileTemplate
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json