performance/tests/orderFileTemplate.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-order-file-template

scenarios:
  get-user-token:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(user-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
  get-order-file-template:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orderFileTemplates
        method: GET
        label: GetOrderFileTemplate
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json